Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Eingelassene Einzeltoiletten
en: Single lavatories being inset

source: Aus Verbundmaterial geformte Einzeltoiletten
en: Single lavatories moulded from composite material

source: Glühende Beleuchtungskörper
en: Incandescent lighting fixtures

source: Gießereiöfen mit Induktionsbeheizung
en: Induction heated casting furnaces

source: Heizöfen für gewerbliche Zwecke
en: Industrial heating furnaces

source: Dunstabzüge [Lüftung oder Klimatisierung]
en: Extractors [ventilation or air conditioning]

source: Ventilatoren für Dunstabzüge
en: Fans for exhaust extractors

source: Sandwichbereiter [Brotröster]
en: Sandwich makers [toasters]

source: Sanitärablaufarmaturen für Becken
en: Sanitary drain armatures for basins

source: Hebelgriffe für Spülkästen
en: Cistern lever handles

source: Heizungsanlagen mit geschlossenem Regelkreis
en: Closed circuit heating installations

source: Wellrohre aus Metall [Teile von sanitären Anlagen]
en: Corrugated pipes of metal [parts of sanitary installations]

source: Kryostate, ausgenommen für Laborzwecke
en: Cryostats, other than for laboratory use

source: Lüftungsgeräte für Wohnräume
en: Residential ventilating units

source: Umkehrosmoseelemente für Haushaltszwecke zur Verminderung des Salzgehaltes im Wasser
en: Reverse osmosis elements for domestic use in reducing the salt content of water

source: Heizkissen, nicht für medizinische Zwecke [elektrisch oder chemisch aktiviert]
en: Heating cushions not for medical purposes [electric or chemically activated]

source: Gasanzünder für Öfen
en: Oven gas igniters

source: Feuerfeste Öfen
en: Refractory furnaces

source: Duschköpfe als Teile von Wasserversorgungsanlagen
en: Shower heads being parts of water supply installations

source: Geräte zum Filtern von Trinkwasser
en: Apparatus for filtering drinking water

source: Wasserregelventile für Wasserzisternen
en: Water control valves for water cisterns

source: Geformte Heizofenauskleidungen
en: Ovens (Shaped fittings for -)

source: Absperrventile für die Wasserregulierung
en: Stop valves for regulating water

source: Öfen zum Heizen
en: Stoves for heating

source: Brenner zum Verbrennen von Öl in Kesseleinheiten
en: Burners for the combustion of oil in boiler units

source: Filter für Wasserabgabevorrichtungen
en: Filters for use with apparatus for water supply

source: Sanitärablaufarmaturen für Duschen
en: Sanitary drain armatures for showers

source: Sanitäre Wasserarmaturen
en: Sanitary water fittings

source: Abgashauben [Dunstabzugshauben]
en: Exhaust hoods [cooker hoods]

source: Flotationsapparate [Öfen]
en: Flotation apparatus [furnaces]

source: Verdampfer für Klimaanlagen
en: Evaporators for air conditioners

source: Elektrische Heizkabel
en: Electric heating cables

source: Dampfgeneratoren [ausgenommen Maschinenteile]
en: Steam boilers, other than parts of machines

source: Rechnergesteuerte Beleuchtungsgeräte
en: Computer controlled lighting apparatus

source: Oberflächenbelüfter für Teiche
en: Surface aerators for ponds

source: Elektrisch beheizte Warmwasserspeicher
en: Electrically heated hot water tanks

source: Druckbegrenzungsventile [Sicherheitsapparate] für Gasgeräte
en: Pressure relief valves [safety apparatus] for gas apparatus

source: Feuerroste für feste Brennstoffe
en: Firing grates for solid fuel

source: Wärmepumpen
en: Heat pumps

source: Reinräume, Sterilräume [sanitäre Einrichtungen]
en: Clean chambers [sanitary installations]

source: Durch Photozellen betriebene Sicherheitsbeleuchtung
en: Photocells (Security lighting operated by -)

source: Kühltheken für Lebensmittel
en: Refrigerated food display apparatus

source: Kühlboxen [gasbetrieben]
en: Refrigerating boxes [gas]

source: Wasserausläufe [Wasserhähne]
en: Water outlets [faucets]

source: Duschtrennwände aus Metall
en: Shower bath screens (Metal -)

source: Öfen zum Beizen von Metallen
en: Furnaces for de-coating metals

source: Hähne für Wasserleitungen
en: Taps for water supply

source: Hähne für Wasserleitungsgeräte
en: Taps for water supply installations

source: Rauchabzüge mit Teleskopeinzug
en: Telescopic combination flues

source: Setzapparate für Abwasser
en: Settler apparatus for sewage

source: Elektrische Lüfter für den persönlichen Gebrauch mit Staubfilterfunktion
en: Electrically powered blowers for dust extraction from the air

source: Elektrisch betriebene Gebläse für Lüftungszwecke
en: Electrically powered blowers for ventilation

source: Elektronisch gesteuerte selbst schließende Duschhähne
en: Electronically controlled self-closing shower-taps

source: Elektrostatische Luftfilter
en: Electrostatic air filters

source: Apparate zum Beheizen von Saunen
en: Saunas (Apparatus for heating -)

source: Stroboskoplampen [Lichteffekte]
en: Stroboscopic lamps [light effects]

source: Ventilatoren für Wärmetauscher
en: Ventilators for heat exchangers

source: Wände für Duschkabinen
en: Walls for shower cubicles

source: Kombinierte Eiswürfelherstellungs- und -ausgabemaschinen
en: Combined ice cube making and dispensing machines

source: Ortsfeste Heizungsbrenner
en: Fixed heating burners

source: Flachheizkörper für Zentralheizungsanlagen
en: Flat radiators for central heating installations

source: Abfackelrohre für die Erdölindustrie
en: Flare stacks for use in the oil industry

source: Biegsame Heizelemente für Kraftfahrzeugsitze
en: Flexible heating elements for automobile seats

source: Durchflussbegrenzer für Umkehrosmose-Wasserreinigungseinheiten
en: Flow restrictors for reverse osmosis water purification units

source: Elektrische Fensterlüfter
en: Electric window fans

source: Warmwasserspeicher
en: Hot water cylinders

source: Kunststoffkniestücke für Rohre [Teile von sanitären Anlagen]
en: Elbow bends (plastic -) for pipes [parts of sanitary installations]

source: Elektrische Nachtlampen
en: Electric night lights

source: Raumheizungen für Fahrzeuge
en: Space heaters for vehicles

source: Gekühlte Platten zur Verwendung mit Elektroöfen
en: Cooled panels for use with electrical furnaces

source: Gaskessel zur Warmwasserbereitung
en: Gas boilers for water heating

source: Leuchtlampen für Projektoren
en: Illuminant lamps for projectors

source: Stationäre Haartrockner
en: Stationary hair dryers

source: Filter für Wasserleitungen
en: Strainers for water lines

source: Beleuchtungsgeräte für Vitrinen
en: Lighting devices for showcases

source: Elektrisch beheizte Fußsäcke
en: Footmuffs, electrically heated

source: Glühdrähte zur Wärmeerzeugung
en: Heat generating filaments

source: Heizkissen zum Wärmen
en: Heat pads for warming

source: Wärmeregelungsgeräte [Ventile] als Teile von Heizungsanlagen
en: Heat regulating devices [valves] being parts of heating installations

source: Nachbrenner als Teile von Öfen
en: Afterburners being parts of furnaces

source: Bratspieße [Kochgeräte]
en: Spits [cooking apparatus]

source: Scheinwerfer für Vehikel
en: Spot lights for use on vehicles

source: Handbrausen für Duschen
en: Spray handsets for showers

source: Sprüheinheiten als Teile von Wasserversorgungsanlagen
en: Spray units being parts of water supply installations

source: Kühlanlagen für Flüssigkeiten
en: Cooling installations for liquids

source: Temperaturregelventile [Teile von Wasserversorgungsanlagen]
en: Temperature control valves [parts of water supply installations]

source: Temperaturempfindliche Regelapparate [Thermostatventile] für Zentralheizungskörper
en: Temperature responsive control apparatus [thermostatic valves] for central heating radiators

source: Mobile sanitäre Anlagen [transportabel]
en: Mobile [portable] sanitary installations

source: Mobile Trockengeräte [Wärmetrocknung]
en: Mobile drying apparatus [heat drying]

source: Heizstäbe zur Stahlentgasung
en: Steel degassing heating rods

source: Elektrische Glühlampen
en: Electric incandescent lamps

source: Strahldüsen zur Erzeugung von Massageströmen in Sprudelbädern
en: Jet nozzles for generating massage currents in spa baths

source: Elektrische Küchenmaschinen zum Kochen
en: Kitchen machines (Electric -) for cooking

source: Kohle für Bogenlampen
en: Carbon for arc lamps

source: Reflektoren zur Anbringung an Fahrradspeichen
en: Bicycle reflectors for attachment to spokes

source: Flammlose Kerzen
en: Flameless candles

source: Wasserfiltergeräte für Haushaltszwecke
en: Water filtering apparatus for domestic use

source: Wasserfiltergeräte für gewerbliche Zwecke
en: Water filtering apparatus for industrial use

source: Entfroster für Fahrzeuge
en: Defrosters for vehicles

source: Hibachi [japanische Kohleheizgeräte für Haushaltszwecke]
en: Japanese charcoal heaters for household purposes use (hibachi)

source: Filterelemente für Überläufe von Wasserversorgungstanks
en: Filter elements for the overflows of water supply tanks

source: Filter für die Reinigung von Gasen [Teile von häuslichen oder gewerblichen Anlagen]
en: Filters for cleaning gases [parts of household or industrial installations]

source: Gekühlte Drucklufttrocknungsanlagen
en: Refrigerated compressed air dryers

source: Toilettenstuhleinheiten mit Waschwasserspritzvorrichtungen
en: Toilet stool units with a washing water squirter

source: Klimaanlagen zur Fenstermontage [für gewerbliche Zwecke]
en: Window-mounting air-conditioners [for industrial purposes]

source: Geräte zur Ausgabe gekühlter Getränke [Kühlgeräte]
en: Apparatus for dispensing chilled beverages

source: Luftreinigungsfilter [Teile von Luftreinigungsmaschinen oder -anlagen]
en: Air cleaning filters [parts of air cleaning machines or installations]

source: Spiritusbrenner für Laborzwecke
en: Alcohol burners for laboratory use

source: Tragbarer elektrischer Warmlufttrockner
en: Portable electric warm air dryer

source: Elektrische Langsamkocher
en: Stew-pots (Electric -)

source: Absperrventile als Sicherheitsapparate für Wassergeräte
en: Stop valves being safety apparatus for water apparatus

source: Destillierapparate [für chemische Verfahren]
en: Distillers [for chemical processing]

source: Keramikplatten als Teile von Backöfen
en: Ceramic plates sold as parts of ovens

source: Lampen mit ausziehbaren Stützen
en: Lamps fitted with extendible supports

source: Lampen für Landfahrzeuge
en: Lamps for motor land vehicles

source: Bremsleuchten für Fahrzeuge
en: Brake lights for vehicles

source: Mit Sonnenenergie betriebene Heizungsanlagen
en: Solar energy powered heating installations

source: Sprinklermaschinen zur Bewässerung im Gartenbau
en: Sprinkler machines for horticultural irrigation

source: Dampfschränke für die Behandlung von Bekleidungsstücken
en: Steam cabinets for the treatment of clothing

source: Sichtscheiben für Heizkessel
en: Sight glasses for boilers

source: Belüftungshauben für Labors
en: Ventilation hoods for laboratories

source: Mikrowellenherde für Haushaltszwecke
en: Microwave ovens for domestic use

source: Mikrowellenherde, nicht für Versuchszwecke
en: Microwave ovens, not for experimental purposes

source: Glühlampen für optische Instrumente
en: Incandescent lamps for optical instruments

source: Ultraviolett-Sonnenlampen für kosmetische Zwecke
en: Ultra-violet sun ray lamps for cosmetic purposes

source: Abzugshauben für Tiefkühlgeräte
en: Extraction hoods for freezers

source: Filter für gewerbliche Anlagen
en: Filters for industrial installations

source: Filter für Trinkwasserverteilungsapparate
en: Filters for sanitary water distribution apparatus

source: Raumluftbefeuchter, die Wasser enthalten und auf Zentralheizungskörper gestellt werden
en: Room humidifiers that contain water and are placed on central heating radiators

source: Wäschetrocknungsanlagen [Wärmetrocknung]
en: Clothes drying installations [heat drying]

source: Kühlbehälter für Öfen
en: Cooling tanks for furnaces

source: Kronen [Teile von Öfen]
en: Crowns [parts of kilns]

source: Automatische Wäschetrockner
en: Automatic linen driers

source: Kühleinheiten als Teile von Wasserkühlanlagen
en: Chiller units being parts of water cooling installations

source: Diffusoren als Teile von Beleuchtungsanlagen
en: Diffusers being parts of lighting installations

source: Abzugshauben für Öfen
en: Oven ventilator hoods

source: Platten [Teile von Herden]
en: Plates [parts of stoves]

source: Glühlampen für Gasentladungslampen
en: Drying apparatus for fodder and forage

source: Lichterketten mit farbigen Lampen
en: Light bulbs for gas-discharge lamps

source: Kaminroste aus Metall für den Haushalt
en: Fire grates (Domestic -) of metal

source: Elektrische Trockner für Wäsche [Wärmetrocknung]
en: Electric dryers for laundry use [heat drying]

source: Sterilisationsgeräte für medizinische Instrumente
en: Sterilization units for medical instruments

source: Verglaste Duschkabinen
en: Glazed shower cubicles

source: Warmwasserbereiter [Apparate]
en: Water heaters [apparatus]

source: Umkehrosmoseelemente zur Verminderung des Salzgehaltes im Wasser
en: Reverse osmosis elements for reducing the salt content of water

source: Gasbetriebene elektrische Grillspieße
en: Roasting spits [electric] for use with gas

source: Zirkulatoren [Wassererhitzer]
en: Circulators [water heaters]

source: Dämpfdüsen [Teile von Feuerstellen]
en: Damping nozzles [parts of fires]

source: Tragbare, horizontal angeordnete zylindrische Raumheizlüfter
en: Forced air type portable horizontally disposed cylindrical space heaters

source: Überdruckventile [Sicherheitsapparate] für Gasleitungen
en: Pressure relief valves [safety apparatus] for gas pipes

source: Drucküberwachungsgeräte [Sicherheitsgeräte für Gasleitungen]
en: Pressure supervision apparatus [safety apparatus for gas pipes]

source: Drucküberwachungsgeräte [Sicherheitsgeräte für Wasserleitungen]
en: Pressure supervision apparatus [safety apparatus for water pipes]

source: Industrielle Kochherde
en: Industrial cooking ovens

source: Industrielle Fritteusen
en: Industrial deep fryers

source: Elektrische Öfen für metallurgische Zwecke
en: Electric furnaces for metallurgical purposes

source: Elektrische Handleuchten [ausgenommen für photographische Zwecke]
en: Electric hand lamps [other than for photographic use]

source: Elektrische Heizgeräte
en: Heating apparatus, electric

source: Wasserdruckminderer [Sicherheitszubehör]
en: Water pressure reducers [safety accessories]

source: Wasserregelventile [Regelungszubehör]
en: Water regulating valves [regulating accessories]

source: Thermoelektrische Geräte zum Erhitzen von Getränken
en: Thermoelectric apparatus for heating beverages

source: Waschbecken
en: Sink units

source: Ummantelte Wärmetauscher
en: Shell heat exchangers

source: Elektrisch betriebene Warmluftgesichtstrockner
en: Electrically powered warm air face dryers

source: Elektrostatische Filter zur Wasserfiltration
en: Electrostatic filters for water filtration

source: Elektrofilter für die Luftreinigung
en: Electrostatic precipitators for cleaning air

source: Lampenschirme zur Lichtlenkung
en: Screens for directing light

source: Stroboskope für Diskotheken
en: Strobe lights for discos

source: Dämpfungsdüsen [Teile von Öfen]
en: Damping nozzles [parts of furnaces]

source: Temperaturempfindliche Steuerungen für automatisch arbeitende Ventile [Teile von Heizungsanlagen]
en: Valves (temperature sensitive controls for automatically operating -) [parts of heating installations]

source: Mit Propandampf betriebene, vertikal angeordnete zylindrische Konvektionsraumheizer
en: Propane vapour-fired vertically disposed cylindrical convection space heaters

source: Biegsame Leuchten
en: Flexible lamps

source: Elektrische Lampen zur Verwendung im Freien
en: Electrical lamps for outdoor lighting

source: Elektrische Beleuchtungskörper zur Verwendung an gefährlichen Standorten
en: Electrical lighting fixtures for use in hazardous locations

source: Heizungsanlagen für Nitratlösungen
en: Heating installations for nitrate solutions

source: Heizungsanlagen zum Einbau in Verglasungen
en: Heating installations incorporated in glass

source: Elektrisch beheizte Becher
en: Electrically-heated mugs

source: Kernreaktoren
en: Nuclear reactors

source: Flexible Ringbandrohre aus Metall [Teile von sanitären Anlagen]
en: Flexible strip wound pipes of metal [parts of sanitary installations]

source: Nachtlichte [ausgenommen Kerzen]
en: Night lights [other than candles]

source: Kühlgeräte für Flüssigkeiten
en: Cooling apparatus for liquids

source: Öfen zum Einschmelzen von Altmetallen
en: Furnaces for melting scrap metals

source: Gaskessel zum Beheizen von Schwimmbecken
en: Gas boilers for the heating of swimming pools

source: Gaskochgeräte mit eingebautem Grillrost
en: Gas cooking apparatus incorporating cooking grills

source: Brausen für Küchenspülen
en: Kitchen sink sprayers

source: Regelgeräte als Teile von Gasbrennern
en: Regulating apparatus being parts of gas burners

source: Regelgeräte für Gasleitungen
en: Regulating apparatus for gas pipes

source: Dampfradiatoren zur Beheizung von Gebäuden
en: Steam radiators for heating buildings

source: Heizkörper [für gewerbliche Klimatisierungszwecke]
en: Radiators [for industrial air-conditioning purposes]

source: Elektrischer Grill
en: Electric rotisseries

source: Härtungsöfen für Federn
en: Hardening furnaces for springs

source: Wärmetauscher zur Beseitigung von Rauchgasen
en: Heat exchangers for the removal of flue gases

source: Sprüharmaturen [Teile von Duschanlagen]
en: Spray fittings [parts of shower installations]

source: Temperaturbegrenzer für Zentralheizungskörper [Thermostatventile] mit bimetallischen Scheiben
en: Temperature limiters for central heating radiators [thermostatic valves] incorporating bi-metallic discs

source: Temperaturregler [Thermostatventile] für Zentralheizungskörper
en: Temperature regulators [thermostatic valves] for central heating radiators

source: Temperaturfühlapparate [Thermostatventile] für Zentralheizungskörper
en: Temperature sensing apparatus [thermostatic valves] for central heating radiators

source: Automatische Bewässerungsanlagen zur Verwendung im Gartenbau
en: Automatic watering installations for use in gardening

source: Rohrschlangen als Teile von Destillieranlagen
en: Coils being parts of distilling installations

source: Radiatoren für Zentralheizungsanlagen
en: Radiators for central heating installations

source: Faseroptische Beleuchtungskörper
en: Fiber optic lighting fixtures

source: Regelventile für Badewannen [Sanitärarmaturen]
en: Tub control valves [plumbing fittings]

source: Luftfilter zum Zurückhalten von Staub in Industrieverfahren
en: Air filters for use as dust arrestants in industrial processes

source: Heizgeräte für Teiche
en: Heating apparatus for ponds

source: Dampferzeuger für Haushaltszwecke
en: Steam generators for domestic use

source: Brennöfen in Form von Bausätzen
en: Kilns for sale in kit form

source: Gasküchenmaschinen zum Kochen
en: Kitchen machines (Gas -) for cooking

source: Schleusen [sanitäre Anlagen]
en: Sluices [sanitary installations]

source: Geräte zur Raucherzeugung für Kochzwecke
en: Smoke generating apparatus for cooking

source: Elektrische Getränkeerhitzer
en: Electric beverage heaters

source: Kühlvitrinen zur Auslage von Getränken
en: Refrigerated cabinets for the display of drink

source: Transportable Wasseraufbereitungsanlagen
en: Transportable instruments for processing water

source: Dunstabzugshauben für Öfen
en: Ventilation hoods for stoves

source: Lavasteine für Barbecue-Grills
en: Lava rocks for use in barbecue grills

source: Luftschaufeln zur Belüftung
en: Air impellers for ventilation

source: Gasbeheizte kombinierte Öfen zur Verwendung in der Produktion von Stahl
en: Gas fired combined furnaces for use in the production of steel

source: LED-Leuchten
en: LED luminaires

source: Röstschachtöfen [für gewerbliche Zwecke]
en: Calcising kilns [for industrial purposes]

source: Hydranten
en: Hydrants

source: Elektrische Kandelaber
en: Electric candelabras

source: Elektrische Dampfgargeräte
en: Electric food steamer

source: Elektrische Fußwärmer
en: Electric foot warmers

source: Laternen aus Keramik
en: Lanterns made of ceramics

source: Kessel für Zentralheizungsanlagen
en: Boilers for central heating installations

source: Bewässerungsmaschinen für Golfplätze
en: Sprinkler machines for use on golf courses

source: Sanitärwaren aus Edelstahl
en: Stainless steel sanitary ware

source: Wandmontierte Einzeltoiletten
en: Single lavatories being wall mounted

source: Ionenpistolen zur Aufbereitung der Luft
en: Ionising guns for the treatment of air

source: Becken als Teile von Wasserversorgungsanlagen
en: Basins being part of water supply installations

source: Leuchtende Hausnummern
en: Luminous house numbers

source: Gebläseräder [Teile von Klimaanlagen]
en: Impellers [parts of air conditioning apparatus]

source: Siphoneinsätze für Sanitärkeramik
en: Waste fittings for sanitary ware

source: Wasserregelventile [Niveauregelung] in Wasserbehältern
en: Water control valves [level controlling] in cisterns

source: Neonröhren für die Beleuchtung
en: Neon lamps for illumination

source: Reflektoren zur Lichtablenkung
en: Reflectors for light deflection

source: Spülkästen als Sanitärgeräte
en: Cisterns being sanitary apparatus

source: Pendelschnüre [Lampenbefestigungen]
en: Cord pendants [light fittings]

source: Umkehrosmoseelemente für gewerbliche Zwecke zur Verminderung des Salzgehaltes im Wasser
en: Reverse osmosis elements for industrial use in reducing the salt content of water

source: Automatische Härtungsöfen für Bauteile
en: Automatic hardening furnaces for components

source: Automatische Bewässerungsanlagen für Rinder
en: Automatic watering installations for cattle

source: Beleuchtungskörper für gewerbliche Zwecke
en: Lighting fixtures for commercial use

source: Lampenverzierungen [Lampenzubehör]
en: Lighting ornaments [fittings]

source: Ultraviolettkühler, nicht für Motoren und Maschinen
en: Ultra-violet radiators not for motors and engines

source: Rückfahrscheinwerfer für Landfahrzeuge
en: Backup lights for land vehicles

source: Wasserhähne als Teile von Wasserversorgungsanlagen
en: Water taps being parts of water supply installations

source: Wasseraufbereitungsgeräte zur Wasserenthärtung
en: Water treatment apparatus for water softening

source: Lichterketten
en: Strings of lights

source: Kamine aus Metallguss
en: Cast metal fireplaces

source: Filter für Taschenlampen
en: Filters for use with torches

source: Armaturen für Sanitärwasserleitungen
en: Sanitary water conduit fittings

source: Abzugsschächte mit eingebauten Lüftern
en: Flues for ventilating apparatus

source: Fettfilter [Teile von Sauglüftern]
en: Grease filters [parts of extractor fans]

source: Raffiniertürme für die Destillation
en: Refining towers for distillation

source: Bratspieße [elektrisch] zur Verwendung mit Grillgeräten
en: Roasting spits [electric] for use with barbecues

source: Steuereinheiten [Thermostatventile] für Heizungsanlagen
en: Control units [thermostatic valves] for heating installations

source: Heizkissen, nicht elektrisch, ausgenommen für medizinische Zwecke
en: Cushions (Heating -), non-electric, other than for medical purposes

source: Luftklappen für Öfen
en: Dampers for furnaces

source: Elektrische Serviergefäße
en: Electrical serving pots

source: Tragbare, horizontal angeordnete Raumheizlüfter
en: Forced air type portable horizontally disposed space heaters

source: Freistehende transportable Dekontaminierungsduschen
en: Freestanding portable decontamination showers

source: Druckgefäße zum Sterilisieren
en: Pressure vessels for sterilising

source: Armaturen für Massagebäder
en: Fittings for massage baths

source: Pyrophorzündgeräte, ausgenommen für Raucher
en: Pyrophoric lighters, other than for smokers
